Revit 2026 API

# AssetPropertyListRemoveAssetProperty Method

---

Remove the AssetProperty from the list.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveAssetProperty(
	int index
)
```
```vb
Public Sub RemoveAssetProperty (
	index As Integer
)
```
```cpp
public:
void RemoveAssetProperty(
	int index
)
```
```fsharp
member RemoveAssetProperty :
        index : int -> unit
```

#### Parameters

index Int32
     Index to remove the AssetProperty from.

| Exception | Condition |
| --- | --- |
| ArgumentException | index is out of range. |
| InvalidOperationException | The asset property is not editable. |

#### Reference

AssetPropertyList Class

Autodesk.Revit.DB.Visual Namespace